suresh569/https-github.com-zephyrproject-rtos-zephyr/include/zephyr/dt-bindings/pinctrl/renesas/pinctrl-r7fa2a1xxxxxx.h
/*
 * Copyright (c) 2024 TOKITA Hiroshi <tokita.hiroshi@fujitsu.com>
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR DT_BINDINGS_PINCTRL_RENESAS_PINCTRL_R7FA2A1XXXXXX_H_
#define ZEPHYR DT_BINDINGS_PINCTRL_RENESAS_PINCTRL_R7FA2A1XXXXXX_H_

#include <zephyr/dt-bindings/pinctrl/renesas/pinctrl-ra-common.h>

#define P000_AGTIO1      RA_PINCFG__36(0,  0, 0x01, RA_PINCFG_FUNC)
#define P000_GTIOC4B     RA_PINCFG__36(0,  0, 0x03, RA_PINCFG_FUNC)
#define P000_KR00        RA_PINCFG__36(0,  0, 0x08, RA_PINCFG_FUNC)
#define P000_MISO9       RA_PINCFG__36(0,  0, 0x05, RA_PINCFG_FUNC)
#define P000_MISOB       RA_PINCFG__36(0,  0, 0x06, RA_PINCFG_FUNC)
#define P000_RXD9        RA_PINCFG__36(0,  0, 0x05, RA_PINCFG_FUNC)
#define P000_SCL0        RA_PINCFG__36(0,  0, 0x07, RA_PINCFG_FUNC)
#define P000_SCL9        RA_PINCFG__36(0,  0, 0x05, RA_PINCFG_FUNC)
#define P000_TS16        RA_PINCFG__36(0,  0, 0x0c, RA_PINCFG_FUNC)
#define P001_CTS9_RTS9   RA_PINCFG__64(0,  1, 0x05, RA_PINCFG_FUNC)
#define P001_RSPCKB      RA_PINCFG__64(0,  1, 0x06, RA_PINCFG_FUNC)
#define P001_RTCOUT      RA_PINCFG__64(0,  1, 0x09, RA_PINCFG_FUNC)
#define P001_SS9         RA_PINCFG__64(0,  1, 0x05, RA_PINCFG_FUNC)
#define P001_TS15        RA_PINCFG__64(0,  1, 0x0c, RA_PINCFG_FUNC)
#define P002_AMP2P       RA_PINCFG__64(0,  2, 0x00, RA_PINCFG_ANALOG)
#define P002_AN007       RA_PINCFG__64(0,  2, 0x00, RA_PINCFG_ANALOG)
#define P002_DA8_1       RA_PINCFG__64(0,  2, 0x0a, RA_PINCFG_ANALOG | RA_PINCFG_FUNC)
#define P002_DA8_1       RA_PINCFG__64(0,  2, 0x0a, RA_PINCFG_ANALOG | RA_PINCFG_FUNC)
#define P003_AMP2M       RA_PINCFG__64(0,  3, 0x00, RA_PINCFG_ANALOG)
#define P003_AN006       RA_PINCFG__64(0,  3, 0x00, RA_PINCFG_ANALOG)
#define P012_AMP2O       RA_PINCFG__64(0, 12, 0x00, RA_PINCFG_ANALOG)
#define P012_AN008       RA_PINCFG__64(0, 12, 0x00, RA_PINCFG_ANALOG)
#define P013_AMP1P       RA_PINCFG__49(0, 13, 0x00, RA_PINCFG_ANALOG)
#define P013_AN005       RA_PINCFG__49(0, 13, 0x00, RA_PINCFG_ANALOG)
#define P013_DA8_0       RA_PINCFG__49(0, 13, 0x0a, RA_PINCFG_ANALOG | RA_PINCFG_FUNC)
#define P013_DA8_0       RA_PINCFG__49(0, 13, 0x0a, RA_PINCFG_ANALOG | RA_PINCFG_FUNC)
#define P013_GTIOC6B     RA_PINCFG__49(0, 13, 0x03, RA_PINCFG_FUNC)
#define P013_IVCMP1      RA_PINCFG__49(0, 13, 0x00, RA_PINCFG_ANALOG)
#define P013_VREFH       RA_PINCFG__49(0, 13, 0x00, RA_PINCFG_ANALOG)
#define P014_AN004       RA_PINCFG__48(0, 14, 0x00, RA_PINCFG_ANALOG)
#define P014_GTIOC6A     RA_PINCFG__48(0, 14, 0x03, RA_PINCFG_FUNC)
#define P014_IVREF1      RA_PINCFG__48(0, 14, 0x00, RA_PINCFG_ANALOG)
#define P014_VREFL       RA_PINCFG__48(0, 14, 0x00, RA_PINCFG_ANALOG)
#define P015_AMP1O       RA_PINCFG__48(0, 15, 0x00, RA_PINCFG_ANALOG)
#define P015_AN003       RA_PINCFG__48(0, 15, 0x00, RA_PINCFG_ANALOG)
#define P100_AN016       RA_PINCFG__32(1,  0, 0x00, RA_PINCFG_ANALOG)
#define P100_ANSD0P      RA_PINCFG__32(1,  0, 0x00, RA_PINCFG_ANALOG)
#define P100_GTIOC5B     RA_PINCFG__32(1,  0, 0x03, RA_PINCFG_FUNC)
#define P100_IVCMP2      RA_PINCFG__32(1,  0, 0x00, RA_PINCFG_ANALOG)
#define P100_MOSI9       RA_PINCFG__32(1,  0, 0x05, RA_PINCFG_FUNC)
#define P100_SDA9        RA_PINCFG__32(1,  0, 0x05, RA_PINCFG_FUNC)
#define P100_TS23        RA_PINCFG__32(1,  0, 0x0c, RA_PINCFG_FUNC)
#define P100_TXD9        RA_PINCFG__32(1,  0, 0x05, RA_PINCFG_FUNC)
#define P101_AN017       RA_PINCFG__32(1,  1, 0x00, RA_PINCFG_ANALOG)
#define P101_ANSD0N      RA_PINCFG__32(1,  1, 0x00, RA_PINCFG_ANALOG)
#define P101_GTIOC5A     RA_PINCFG__32(1,  1, 0x03, RA_PINCFG_FUNC)
#define P101_IVREF2      RA_PINCFG__32(1,  1, 0x00, RA_PINCFG_ANALOG)
#define P101_MISO9       RA_PINCFG__32(1,  1, 0x05, RA_PINCFG_FUNC)
#define P101_MISO9       RA_PINCFG__32(1,  1, 0x05, RA_PINCFG_FUNC)
#define P101_RXD9        RA_PINCFG__32(1,  1, 0x05, RA_PINCFG_FUNC)
#define P101_RXD9        RA_PINCFG__32(1,  1, 0x05, RA_PINCFG_FUNC)
#define P101_SCL9        RA_PINCFG__32(1,  1, 0x05, RA_PINCFG_FUNC)
#define P101_SCL9        RA_PINCFG__32(1,  1, 0x05, RA_PINCFG_FUNC)
#define P101_TS22        RA_PINCFG__32(1,  1, 0x0c, RA_PINCFG_FUNC)
#define P102_AN018       RA_PINCFG__49(1,  2, 0x00, RA_PINCFG_ANALOG)
#define P102_ANSD1P      RA_PINCFG__49(1,  2, 0x00, RA_PINCFG_ANALOG)
#define P102_CTS9_RTS9   RA_PINCFG__49(1,  2, 0x05, RA_PINCFG_FUNC)
#define P102_GTIOC6B     RA_PINCFG__49(1,  2, 0x03, RA_PINCFG_FUNC)
#define P102_SS9         RA_PINCFG__49(1,  2, 0x05, RA_PINCFG_FUNC)
#define P102_SSLB0       RA_PINCFG__49(1,  2, 0x06, RA_PINCFG_FUNC)
#define P102_TS21        RA_PINCFG__49(1,  2, 0x0c, RA_PINCFG_FUNC)
#define P103_AN019       RA_PINCFG__49(1,  3, 0x00, RA_PINCFG_ANALOG)
#define P103_ANSD1N      RA_PINCFG__49(1,  3, 0x00, RA_PINCFG_ANALOG)
#define P103_GTIOC6A     RA_PINCFG__49(1,  3, 0x03, RA_PINCFG_FUNC)
#define P103_RSPCKB      RA_PINCFG__49(1,  3, 0x06, RA_PINCFG_FUNC)
#define P103_TS20        RA_PINCFG__49(1,  3, 0x0c, RA_PINCFG_FUNC)
#define P104_AN020       RA_PINCFG__48(1,  4, 0x00, RA_PINCFG_ANALOG)
#define P104_ANSD2P      RA_PINCFG__48(1,  4, 0x00, RA_PINCFG_ANALOG)
#define P104_MISOB       RA_PINCFG__48(1,  4, 0x06, RA_PINCFG_FUNC)
#define P104_TS19        RA_PINCFG__48(1,  4, 0x0c, RA_PINCFG_FUNC)
#define P105_AN021       RA_PINCFG__48(1,  5, 0x00, RA_PINCFG_ANALOG)
#define P105_ANSD2N      RA_PINCFG__48(1,  5, 0x00, RA_PINCFG_ANALOG)
#define P105_MOSIB       RA_PINCFG__48(1,  5, 0x06, RA_PINCFG_FUNC)
#define P105_TS18        RA_PINCFG__48(1,  5, 0x0c, RA_PINCFG_FUNC)
#define P106_AN022       RA_PINCFG__64(1,  6, 0x00, RA_PINCFG_ANALOG)
#define P106_ANSD3P      RA_PINCFG__64(1,  6, 0x00, RA_PINCFG_ANALOG)
#define P107_AN023       RA_PINCFG__64(1,  7, 0x00, RA_PINCFG_ANALOG)
#define P107_ANSD3N      RA_PINCFG__64(1,  7, 0x00, RA_PINCFG_ANALOG)
#define P109_ADTRG0      RA_PINCFG__32(1,  9, 0x0a, RA_PINCFG_FUNC)
#define P109_AGTOA0      RA_PINCFG__32(1,  9, 0x01, RA_PINCFG_FUNC)
#define P109_CMPREF0     RA_PINCFG__32(1,  9, 0x00, RA_PINCFG_ANALOG)
#define P109_GTETRGB     RA_PINCFG__32(1,  9, 0x02, RA_PINCFG_FUNC)
#define P109_GTIOC1B     RA_PINCFG__32(1,  9, 0x03, RA_PINCFG_FUNC)
#define P109_KR01        RA_PINCFG__32(1,  9, 0x08, RA_PINCFG_FUNC)
#define P109_MISOA       RA_PINCFG__32(1,  9, 0x06, RA_PINCFG_FUNC)
#define P109_MOSI9       RA_PINCFG__32(1,  9, 0x05, RA_PINCFG_FUNC)
#define P109_SCK0        RA_PINCFG__32(1,  9, 0x04, RA_PINCFG_FUNC)
#define P109_SCL1        RA_PINCFG__32(1,  9, 0x07, RA_PINCFG_FUNC)
#define P109_SDA9        RA_PINCFG__32(1,  9, 0x05, RA_PINCFG_FUNC)
#define P109_TS17        RA_PINCFG__32(1,  9, 0x0c, RA_PINCFG_FUNC)
#define P109_TXD9        RA_PINCFG__32(1,  9, 0x05, RA_PINCFG_FUNC)
#define P109_VCOUT       RA_PINCFG__32(1,  9, 0x09, RA_PINCFG_FUNC)
#define P110_ADTRG0      RA_PINCFG__32(1, 10, 0x0a, RA_PINCFG_FUNC)
#define P110_AGTOB0      RA_PINCFG__32(1, 10, 0x01, RA_PINCFG_FUNC)
#define P110_CLKOUT      RA_PINCFG__32(1, 10, 0x09, RA_PINCFG_FUNC)
#define P110_CMPREF1     RA_PINCFG__32(1, 10, 0x00, RA_PINCFG_ANALOG)
#define P110_CTX0        RA_PINCFG__32(1, 10, 0x10, RA_PINCFG_FUNC)
#define P110_GTIOC2B     RA_PINCFG__32(1, 10, 0x03, RA_PINCFG_FUNC)
#define P110_GTOWLO      RA_PINCFG__32(1, 10, 0x02, RA_PINCFG_FUNC)
#define P110_MOSI0       RA_PINCFG__32(1, 10, 0x04, RA_PINCFG_FUNC)
#define P110_MOSI9       RA_PINCFG__32(1, 10, 0x05, RA_PINCFG_FUNC)
#define P110_RSPCKA      RA_PINCFG__32(1, 10, 0x06, RA_PINCFG_FUNC)
#define P110_RXD9        RA_PINCFG__32(1, 10, 0x05, RA_PINCFG_FUNC)
#define P110_SCL9        RA_PINCFG__32(1, 10, 0x05, RA_PINCFG_FUNC)
#define P110_SDA0        RA_PINCFG__32(1, 10, 0x04, RA_PINCFG_FUNC)
#define P110_SDA1        RA_PINCFG__32(1, 10, 0x07, RA_PINCFG_FUNC)
#define P110_TSCAP       RA_PINCFG__32(1, 10, 0x0c, RA_PINCFG_FUNC)
#define P110_TXD0        RA_PINCFG__32(1, 10, 0x04, RA_PINCFG_FUNC)
#define P111_RSPCKA      RA_PINCFG__64(1, 11, 0x06, RA_PINCFG_FUNC)
#define P111_RTCOUT      RA_PINCFG__64(1, 11, 0x09, RA_PINCFG_FUNC)
#define P111_SCL1        RA_PINCFG__64(1, 11, 0x07, RA_PINCFG_FUNC)
#define P111_TS14        RA_PINCFG__64(1, 11, 0x0c, RA_PINCFG_FUNC)
#define P112_CLKOUT      RA_PINCFG__64(1, 12, 0x09, RA_PINCFG_FUNC)
#define P112_SDA1        RA_PINCFG__64(1, 12, 0x07, RA_PINCFG_FUNC)
#define P112_SSLA0       RA_PINCFG__64(1, 12, 0x06, RA_PINCFG_FUNC)
#define P112_TSCAP       RA_PINCFG__64(1, 12, 0x0c, RA_PINCFG_FUNC)
#define P204_MISO0       RA_PINCFG__64(2,  4, 0x04, RA_PINCFG_FUNC)
#define P204_MOSIB       RA_PINCFG__64(2,  4, 0x06, RA_PINCFG_FUNC)
#define P204_RXD0        RA_PINCFG__64(2,  4, 0x04, RA_PINCFG_FUNC)
#define P204_SCK9        RA_PINCFG__64(2,  4, 0x05, RA_PINCFG_FUNC)
#define P204_SCL0        RA_PINCFG__64(2,  4, 0x04, RA_PINCFG_FUNC)
#define P204_TS09        RA_PINCFG__64(2,  4, 0x0c, RA_PINCFG_FUNC)
#define P205_CTS1_RTS1   RA_PINCFG__64(2,  5, 0x05, RA_PINCFG_FUNC)
#define P205_GTIOC3B     RA_PINCFG__64(2,  5, 0x03, RA_PINCFG_FUNC)
#define P205_GTOVLO      RA_PINCFG__64(2,  5, 0x02, RA_PINCFG_FUNC)
#define P205_MISOB       RA_PINCFG__64(2,  5, 0x06, RA_PINCFG_FUNC)
#define P205_MOSI0       RA_PINCFG__64(2,  5, 0x04, RA_PINCFG_FUNC)
#define P205_SDA0        RA_PINCFG__64(2,  5, 0x04, RA_PINCFG_FUNC)
#define P205_SDA1        RA_PINCFG__64(2,  5, 0x07, RA_PINCFG_FUNC)
#define P205_SS1         RA_PINCFG__64(2,  5, 0x05, RA_PINCFG_FUNC)
#define P205_TS08        RA_PINCFG__64(2,  5, 0x0c, RA_PINCFG_FUNC)
#define P205_TXD0        RA_PINCFG__64(2,  5, 0x04, RA_PINCFG_FUNC)
#define P206_AGTIO0      RA_PINCFG__48(2,  6, 0x01, RA_PINCFG_FUNC)
#define P206_CTS0_RTS0   RA_PINCFG__48(2,  6, 0x04, RA_PINCFG_FUNC)
#define P206_GTIOC3A     RA_PINCFG__48(2,  6, 0x03, RA_PINCFG_FUNC)
#define P206_GTOVUP      RA_PINCFG__48(2,  6, 0x02, RA_PINCFG_FUNC)
#define P206_MOSI1       RA_PINCFG__48(2,  6, 0x05, RA_PINCFG_FUNC)
#define P206_SCL1        RA_PINCFG__48(2,  6, 0x07, RA_PINCFG_FUNC)
#define P206_SDA1        RA_PINCFG__48(2,  6, 0x05, RA_PINCFG_FUNC)
#define P206_SS0         RA_PINCFG__48(2,  6, 0x04, RA_PINCFG_FUNC)
#define P206_SSLB0       RA_PINCFG__48(2,  6, 0x06, RA_PINCFG_FUNC)
#define P206_TS07        RA_PINCFG__48(2,  6, 0x0c, RA_PINCFG_FUNC)
#define P206_TXD1        RA_PINCFG__48(2,  6, 0x05, RA_PINCFG_FUNC)
#define P212_AGTIO0      RA_PINCFG__32(2, 12, 0x01, RA_PINCFG_FUNC)
#define P212_GTETRGB     RA_PINCFG__32(2, 12, 0x02, RA_PINCFG_FUNC)
#define P212_GTIOC0B     RA_PINCFG__32(2, 12, 0x03, RA_PINCFG_FUNC)
#define P212_MOSI1       RA_PINCFG__32(2, 12, 0x05, RA_PINCFG_FUNC)
#define P212_SDA1        RA_PINCFG__32(2, 12, 0x05, RA_PINCFG_FUNC)
#define P212_TXD1        RA_PINCFG__32(2, 12, 0x05, RA_PINCFG_FUNC)
#define P213_AGTEE1      RA_PINCFG__32(2, 13, 0x01, RA_PINCFG_FUNC)
#define P213_GTETRGA     RA_PINCFG__32(2, 13, 0x02, RA_PINCFG_FUNC)
#define P213_GTIOC0A     RA_PINCFG__32(2, 13, 0x03, RA_PINCFG_FUNC)
#define P213_MISO1       RA_PINCFG__32(2, 13, 0x05, RA_PINCFG_FUNC)
#define P213_RXD1        RA_PINCFG__32(2, 13, 0x05, RA_PINCFG_FUNC)
#define P213_SCL1        RA_PINCFG__32(2, 13, 0x05, RA_PINCFG_FUNC)
#define P301_AGTOB1      RA_PINCFG__32(3,  1, 0x01, RA_PINCFG_FUNC)
#define P301_CTS9_RTS9   RA_PINCFG__32(3,  1, 0x05, RA_PINCFG_FUNC)
#define P301_GTIOC2A     RA_PINCFG__32(3,  1, 0x03, RA_PINCFG_FUNC)
#define P301_GTOWUP      RA_PINCFG__32(3,  1, 0x02, RA_PINCFG_FUNC)
#define P301_KR04        RA_PINCFG__32(3,  1, 0x08, RA_PINCFG_FUNC)
#define P301_MISO0       RA_PINCFG__32(3,  1, 0x04, RA_PINCFG_FUNC)
#define P301_MOSIB       RA_PINCFG__32(3,  1, 0x06, RA_PINCFG_FUNC)
#define P301_RTCOUT      RA_PINCFG__32(3,  1, 0x09, RA_PINCFG_FUNC)
#define P301_RXD0        RA_PINCFG__32(3,  1, 0x04, RA_PINCFG_FUNC)
#define P301_SCL0        RA_PINCFG__32(3,  1, 0x04, RA_PINCFG_FUNC)
#define P301_SDA0        RA_PINCFG__32(3,  1, 0x07, RA_PINCFG_FUNC)
#define P301_SS9         RA_PINCFG__32(3,  1, 0x05, RA_PINCFG_FUNC)
#define P301_TS13        RA_PINCFG__32(3,  1, 0x0c, RA_PINCFG_FUNC)
#define P302_AGTOA1      RA_PINCFG__48(3,  2, 0x01, RA_PINCFG_FUNC)
#define P302_CACREF      RA_PINCFG__48(3,  2, 0x0a, RA_PINCFG_FUNC)
#define P302_GTIOC3B     RA_PINCFG__48(3,  2, 0x03, RA_PINCFG_FUNC)
#define P302_GTOVLO      RA_PINCFG__48(3,  2, 0x02, RA_PINCFG_FUNC)
#define P302_KR05        RA_PINCFG__48(3,  2, 0x08, RA_PINCFG_FUNC)
#define P302_MISO1       RA_PINCFG__48(3,  2, 0x05, RA_PINCFG_FUNC)
#define P302_MOSI0       RA_PINCFG__48(3,  2, 0x04, RA_PINCFG_FUNC)
#define P302_RSPCKB      RA_PINCFG__48(3,  2, 0x06, RA_PINCFG_FUNC)
#define P302_RXD1        RA_PINCFG__48(3,  2, 0x05, RA_PINCFG_FUNC)
#define P302_SCL1        RA_PINCFG__48(3,  2, 0x05, RA_PINCFG_FUNC)
#define P302_SDA0        RA_PINCFG__48(3,  2, 0x04, RA_PINCFG_FUNC)
#define P302_TS12        RA_PINCFG__48(3,  2, 0x0c, RA_PINCFG_FUNC)
#define P302_TXD0        RA_PINCFG__48(3,  2, 0x04, RA_PINCFG_FUNC)
#define P303_CRX0        RA_PINCFG__64(3,  3, 0x10, RA_PINCFG_FUNC)
#define P303_CTS0_RTS0   RA_PINCFG__64(3,  3, 0x04, RA_PINCFG_FUNC)
#define P303_GTIOC6B     RA_PINCFG__64(3,  3, 0x03, RA_PINCFG_FUNC)
#define P303_KR06        RA_PINCFG__64(3,  3, 0x08, RA_PINCFG_FUNC)
#define P303_MOSIA       RA_PINCFG__64(3,  3, 0x06, RA_PINCFG_FUNC)
#define P303_SCK1        RA_PINCFG__64(3,  3, 0x05, RA_PINCFG_FUNC)
#define P303_SS0         RA_PINCFG__64(3,  3, 0x04, RA_PINCFG_FUNC)
#define P303_TS11        RA_PINCFG__64(3,  3, 0x0c, RA_PINCFG_FUNC)
#define P304_CTX0        RA_PINCFG__64(3,  4, 0x10, RA_PINCFG_FUNC)
#define P304_GTIOC6A     RA_PINCFG__64(3,  4, 0x03, RA_PINCFG_FUNC)
#define P304_KR07        RA_PINCFG__64(3,  4, 0x08, RA_PINCFG_FUNC)
#define P304_MISOA       RA_PINCFG__64(3,  4, 0x06, RA_PINCFG_FUNC)
#define P304_MOSI9       RA_PINCFG__64(3,  4, 0x05, RA_PINCFG_FUNC)
#define P304_SCK0        RA_PINCFG__64(3,  4, 0x04, RA_PINCFG_FUNC)
#define P304_SDA9        RA_PINCFG__64(3,  4, 0x05, RA_PINCFG_FUNC)
#define P304_TS10        RA_PINCFG__64(3,  4, 0x0c, RA_PINCFG_FUNC)
#define P304_TXD9        RA_PINCFG__64(3,  4, 0x05, RA_PINCFG_FUNC)
#define P400_AGTEE0      RA_PINCFG__32(4,  0, 0x01, RA_PINCFG_FUNC)
#define P400_CMPIN0      RA_PINCFG__32(4,  0, 0x00, RA_PINCFG_ANALOG)
#define P400_CTS0_RTS0   RA_PINCFG__32(4,  0, 0x04, RA_PINCFG_FUNC)
#define P400_GTETRGA     RA_PINCFG__32(4,  0, 0x02, RA_PINCFG_FUNC)
#define P400_GTIOC1A     RA_PINCFG__32(4,  0, 0x03, RA_PINCFG_FUNC)
#define P400_KR02        RA_PINCFG__32(4,  0, 0x08, RA_PINCFG_FUNC)
#define P400_MISO1       RA_PINCFG__32(4,  0, 0x05, RA_PINCFG_FUNC)
#define P400_MOSIA       RA_PINCFG__32(4,  0, 0x06, RA_PINCFG_FUNC)
#define P400_RTCOUT      RA_PINCFG__32(4,  0, 0x09, RA_PINCFG_FUNC)
#define P400_RXD1        RA_PINCFG__32(4,  0, 0x05, RA_PINCFG_FUNC)
#define P400_SCL1        RA_PINCFG__32(4,  0, 0x05, RA_PINCFG_FUNC)
#define P400_SDA1        RA_PINCFG__32(4,  0, 0x07, RA_PINCFG_FUNC)
#define P400_SS0         RA_PINCFG__32(4,  0, 0x04, RA_PINCFG_FUNC)
#define P400_TS00        RA_PINCFG__32(4,  0, 0x0c, RA_PINCFG_FUNC)
#define P401_AGTEE1      RA_PINCFG__48(4,  1, 0x01, RA_PINCFG_FUNC)
#define P401_GTIOC4A     RA_PINCFG__48(4,  1, 0x03, RA_PINCFG_FUNC)
#define P401_GTIU        RA_PINCFG__48(4,  1, 0x02, RA_PINCFG_FUNC)
#define P401_KR03        RA_PINCFG__48(4,  1, 0x08, RA_PINCFG_FUNC)
#define P401_SCK0        RA_PINCFG__48(4,  1, 0x04, RA_PINCFG_FUNC)
#define P401_SCK9        RA_PINCFG__48(4,  1, 0x05, RA_PINCFG_FUNC)
#define P401_SDA0        RA_PINCFG__48(4,  1, 0x07, RA_PINCFG_FUNC)
#define P401_SSLB1       RA_PINCFG__48(4,  1, 0x06, RA_PINCFG_FUNC)
#define P401_TS01        RA_PINCFG__48(4,  1, 0x0c, RA_PINCFG_FUNC)
#define P401_VCOUT       RA_PINCFG__48(4,  1, 0x09, RA_PINCFG_FUNC)
#define P402_CTS9_RTS9   RA_PINCFG__64(4,  2, 0x05, RA_PINCFG_FUNC)
#define P402_GTIOC0A     RA_PINCFG__64(4,  2, 0x03, RA_PINCFG_FUNC)
#define P402_GTIV        RA_PINCFG__64(4,  2, 0x02, RA_PINCFG_FUNC)
#define P402_SS9         RA_PINCFG__64(4,  2, 0x05, RA_PINCFG_FUNC)
#define P402_SSLB2       RA_PINCFG__64(4,  2, 0x06, RA_PINCFG_FUNC)
#define P402_TS02        RA_PINCFG__64(4,  2, 0x0c, RA_PINCFG_FUNC)
#define P403_GTIOC0B     RA_PINCFG__64(4,  3, 0x03, RA_PINCFG_FUNC)
#define P403_GTIW        RA_PINCFG__64(4,  3, 0x02, RA_PINCFG_FUNC)
#define P403_SCK1        RA_PINCFG__64(4,  3, 0x05, RA_PINCFG_FUNC)
#define P403_SSLB3       RA_PINCFG__64(4,  3, 0x06, RA_PINCFG_FUNC)
#define P403_TS03        RA_PINCFG__64(4,  3, 0x0c, RA_PINCFG_FUNC)
#define P407_AGTIO0      RA_PINCFG__32(4,  7, 0x01, RA_PINCFG_FUNC)
#define P407_CACREF      RA_PINCFG__32(4,  7, 0x0a, RA_PINCFG_FUNC)
#define P407_CTX0        RA_PINCFG__32(4,  7, 0x10, RA_PINCFG_FUNC)
#define P407_GTIOC0B     RA_PINCFG__32(4,  7, 0x03, RA_PINCFG_FUNC)
#define P407_GTOULO      RA_PINCFG__32(4,  7, 0x02, RA_PINCFG_FUNC)
#define P407_MOSI0       RA_PINCFG__32(4,  7, 0x04, RA_PINCFG_FUNC)
#define P407_MOSI9       RA_PINCFG__32(4,  7, 0x05, RA_PINCFG_FUNC)
#define P407_RSPCKB      RA_PINCFG__32(4,  7, 0x06, RA_PINCFG_FUNC)
#define P407_SCL0        RA_PINCFG__32(4,  7, 0x07, RA_PINCFG_FUNC)
#define P407_SDA0        RA_PINCFG__32(4,  7, 0x04, RA_PINCFG_FUNC)
#define P407_SDA9        RA_PINCFG__32(4,  7, 0x05, RA_PINCFG_FUNC)
#define P407_TSCAP       RA_PINCFG__32(4,  7, 0x0c, RA_PINCFG_FUNC)
#define P407_TXD0        RA_PINCFG__32(4,  7, 0x04, RA_PINCFG_FUNC)
#define P407_TXD9        RA_PINCFG__32(4,  7, 0x05, RA_PINCFG_FUNC)
#define P407_USB_VBUS    RA_PINCFG__32(4,  7, 0x13, RA_PINCFG_FUNC)
#define P408_AGTO0       RA_PINCFG__32(4,  8, 0x01, RA_PINCFG_FUNC)
#define P408_CMPIN1      RA_PINCFG__32(4,  8, 0x00, RA_PINCFG_ANALOG)
#define P408_CRX0        RA_PINCFG__32(4,  8, 0x10, RA_PINCFG_FUNC)
#define P408_GTIOC0A     RA_PINCFG__32(4,  8, 0x03, RA_PINCFG_FUNC)
#define P408_GTOUUP      RA_PINCFG__32(4,  8, 0x02, RA_PINCFG_FUNC)
#define P408_MISO0       RA_PINCFG__32(4,  8, 0x04, RA_PINCFG_FUNC)
#define P408_MOSI1       RA_PINCFG__32(4,  8, 0x05, RA_PINCFG_FUNC)
#define P408_RXD0        RA_PINCFG__32(4,  8, 0x04, RA_PINCFG_FUNC)
#define P408_SCL0        RA_PINCFG__32(4,  8, 0x04, RA_PINCFG_FUNC)
#define P408_SDA0        RA_PINCFG__32(4,  8, 0x07, RA_PINCFG_FUNC)
#define P408_SDA1        RA_PINCFG__32(4,  8, 0x05, RA_PINCFG_FUNC)
#define P408_SSLA0       RA_PINCFG__32(4,  8, 0x06, RA_PINCFG_FUNC)
#define P408_TS06        RA_PINCFG__32(4,  8, 0x0c, RA_PINCFG_FUNC)
#define P408_TXD1        RA_PINCFG__32(4,  8, 0x05, RA_PINCFG_FUNC)
#define P409_AGTO1       RA_PINCFG__48(4,  9, 0x01, RA_PINCFG_FUNC)
#define P409_CTS1_RTS1   RA_PINCFG__48(4,  9, 0x05, RA_PINCFG_FUNC)
#define P409_CTX0        RA_PINCFG__48(4,  9, 0x10, RA_PINCFG_FUNC)
#define P409_GTIOC0A     RA_PINCFG__48(4,  9, 0x03, RA_PINCFG_FUNC)
#define P409_SCK0        RA_PINCFG__48(4,  9, 0x04, RA_PINCFG_FUNC)
#define P409_SCL0        RA_PINCFG__48(4,  9, 0x07, RA_PINCFG_FUNC)
#define P409_SS1         RA_PINCFG__48(4,  9, 0x05, RA_PINCFG_FUNC)
#define P409_SSLA1       RA_PINCFG__48(4,  9, 0x06, RA_PINCFG_FUNC)
#define P409_TSCAP       RA_PINCFG__48(4,  9, 0x0c, RA_PINCFG_FUNC)
#define P410_CTS0_RTS0   RA_PINCFG__64(4, 10, 0x04, RA_PINCFG_FUNC)
#define P410_GTIOC5B     RA_PINCFG__64(4, 10, 0x03, RA_PINCFG_FUNC)
#define P410_MOSI1       RA_PINCFG__64(4, 10, 0x05, RA_PINCFG_FUNC)
#define P410_SDA1        RA_PINCFG__64(4, 10, 0x05, RA_PINCFG_FUNC)
#define P410_SS0         RA_PINCFG__64(4, 10, 0x04, RA_PINCFG_FUNC)
#define P410_SSLA2       RA_PINCFG__64(4, 10, 0x06, RA_PINCFG_FUNC)
#define P410_TS05        RA_PINCFG__64(4, 10, 0x0c, RA_PINCFG_FUNC)
#define P410_TXD1        RA_PINCFG__64(4, 10, 0x05, RA_PINCFG_FUNC)
#define P411_GTIOC5A     RA_PINCFG__64(4, 11, 0x03, RA_PINCFG_FUNC)
#define P411_MISO1       RA_PINCFG__64(4, 11, 0x05, RA_PINCFG_FUNC)
#define P411_MOSI0       RA_PINCFG__64(4, 11, 0x04, RA_PINCFG_FUNC)
#define P411_RXD1        RA_PINCFG__64(4, 11, 0x05, RA_PINCFG_FUNC)
#define P411_SCL1        RA_PINCFG__64(4, 11, 0x05, RA_PINCFG_FUNC)
#define P411_SDA0        RA_PINCFG__64(4, 11, 0x04, RA_PINCFG_FUNC)
#define P411_SSLA3       RA_PINCFG__64(4, 11, 0x06, RA_PINCFG_FUNC)
#define P411_TS04        RA_PINCFG__64(4, 11, 0x0c, RA_PINCFG_FUNC)
#define P411_TXD0        RA_PINCFG__64(4, 11, 0x04, RA_PINCFG_FUNC)
#define P500_AMP0P       RA_PINCFG__32(5,  0, 0x00, RA_PINCFG_ANALOG)
#define P500_AN000       RA_PINCFG__32(5,  0, 0x00, RA_PINCFG_ANALOG)
#define P500_DA12_0      RA_PINCFG__32(5,  0, 0x0a, RA_PINCFG_ANALOG | RA_PINCFG_FUNC)
#define P500_DA12_0      RA_PINCFG__32(5,  0, 0x0a, RA_PINCFG_ANALOG | RA_PINCFG_FUNC)
#define P500_GTIOC5A     RA_PINCFG__32(5,  0, 0x03, RA_PINCFG_FUNC)
#define P500_IVCMP0      RA_PINCFG__32(5,  0, 0x00, RA_PINCFG_ANALOG)
#define P500_MISO0       RA_PINCFG__32(5,  0, 0x04, RA_PINCFG_FUNC)
#define P500_RXD0        RA_PINCFG__32(5,  0, 0x04, RA_PINCFG_FUNC)
#define P500_SCL0        RA_PINCFG__32(5,  0, 0x04, RA_PINCFG_FUNC)
#define P500_TS24        RA_PINCFG__32(5,  0, 0x0c, RA_PINCFG_FUNC)
#define P501_AMP0P       RA_PINCFG__32(5,  1, 0x00, RA_PINCFG_ANALOG)
#define P501_AN001       RA_PINCFG__32(5,  1, 0x00, RA_PINCFG_ANALOG)
#define P501_GTIOC5B     RA_PINCFG__32(5,  1, 0x03, RA_PINCFG_FUNC)
#define P501_IVREF0      RA_PINCFG__32(5,  1, 0x00, RA_PINCFG_ANALOG)
#define P501_MOSI0       RA_PINCFG__32(5,  1, 0x04, RA_PINCFG_FUNC)
#define P501_SDA0        RA_PINCFG__32(5,  1, 0x04, RA_PINCFG_FUNC)
#define P501_TS25        RA_PINCFG__32(5,  1, 0x0c, RA_PINCFG_FUNC)
#define P501_TXD0        RA_PINCFG__32(5,  1, 0x04, RA_PINCFG_FUNC)
#define P502_AMP0O       RA_PINCFG__32(5,  2, 0x00, RA_PINCFG_ANALOG)
#define P502_AN002       RA_PINCFG__32(5,  2, 0x00, RA_PINCFG_ANALOG)
#define P502_CTS0_RTS0   RA_PINCFG__32(5,  2, 0x04, RA_PINCFG_FUNC)
#define P502_SS0         RA_PINCFG__32(5,  2, 0x04, RA_PINCFG_FUNC)

#endif
